posts/2018-07-01-leveraging-variadics/index.org
#+TITLE: Leveraging algebraic types in C++
#+AUTHOR: Daniel Grumberg
#+DATE: <2018-07-01 Sun>

* Introduction

Today, we will be looking at the new flagship variadic types that are offered in modern C++ [[http://en.cppreference.com/w/cpp/utility/tuple][~std::tuple~]] and [[http://en.cppreference.com/w/cpp/utility/variant/variant][~std::variant~]].
This post is not meant to teach you how to implement your own variadic templates, if you are into that check out my [[file: ../variadic-templates/index.org][previous post]].
Instead, I focus on demonstrating the usage of the standard library's own variadic types, so don't sweat it if you are not a template meta-programming expert.

One of the main reasons variadic templates were introduced to the language in the C++11 standard was to enable the definitions of the product and sum types.
People refer to these as algebraic types due to the connection to algebra and set theory, but don't let that scare you away.
These are namely, ~std::tuple~ (introduced in C++11) and ~std::variant~ (introduced C++17) in that order.

Tuples are what you would expect if you have encountered them in other languages.
If you have never seen them before, they represent the Cartesian product of the provided template parameters (think of it as an anonymous struct with anonymous fields).
Variants aim to implement a better alternative to C-style unions.

Defining algebraic types was possible before C++11, but was somewhat convoluted and the usage was often unintuitive.
If you have ever implemented or dealt with typelists you will know what I mean.
However, we can now make use of the standard library's robust implementation of these ideas to easily improve the safety and readability of our code.

* Tuples

As you know, we can not return multiple values from a function in C++.
To tackle this issue, we often define structs to encapsulate all the values we wish to return.
When we do this we often define useful abstractions in the problem domain, but there are a lot of cases where this introduces syntactic overhead.
Tuples are very interesting in this context.
They allow us to pass/return multiple logically grouped values at once without the burden of defining a type for this purpose.
Furthermore, they allow us to create compound types programmatically according to user input which can be an incredibly useful facility.

** API

The API is super simple, it provides constructors, destructor, a specialisation of the swap algorithm and comparison operators that operate lexicographically.
It also provides ~tuple_cat~ which concatenates any number of tuples into one big tuple, and ~forward_as_tuple~ which takes a bunch of r-value references and forwards them as a tuple of r-value references.
It also provides the nifty ~make_tuple~ which allows us to deduce the type of the tuple we are trying to instantiate, essentially it allows us to write ~auto t = std::make_tuple(1u, 1.0f, true)~ where ~t~ is deduced to be of type ~tuple<unsigned, float, bool>~.

The one thing I have not touched upon is how to read individual values out of a tuple.
There are essentially three ways of doing this:

- If you want to read a single value out, your best option is ~get~, which given a zero-based index will return a reference to the value contained in the tuple, the usage is a as follows:

  #+BEGIN_SRC cpp
    auto t = std::make_tuple(1u, 1.0f, true);
    auto f = std::get<1>(t); // f now has value 1.0f
  #+END_SRC

- If you want to read all the values in a tuple inside local variables, you should use ~tie~ instead of getting each value individually:

  #+BEGIN_SRC cpp
    auto t = std::make_tuple(1u, 1.0f, true);
    unsigned u; float f;
    std::tie(u, f, std::ignore) = t; // u now contains 1u and f contains 1.0f
  #+END_SRC

It achieves this seemingly magical behaviour by creating and returning a tuple of references to the provided variables.
The assignment happens simply through the tuple assignment operator between unrelated tuples.
Here ~ignore~ is a special value that acts as a placeholder for values we are not interested in.

- The only problem with ~tie~ is that you have to pre-declare your variables and provide the types yourself.
This can lead to nasty surprises with implicit type conversions.
If you have a C++17 compliant compiler, you should use the new structured bindings feature instead.
These are now part of the language syntax so you can not implement them in user code, but the usage it lets type-inference work its magic, which provides the correct type for the variables:

#+BEGIN_SRC cpp
    auto t = std::make_tuple(1u, 1.0f, true);
    auto [u, f, dummy] = t; // u now contains 1u and f contains 1.0f and dummy is true
#+END_SRC

The only issue with this is that you can not ignore values in the tuple.
In the above snippet the compiler would complain about ~dummy~ not being used in later code unless you supply ~-Wunused-variable~ to the compiler which you might not want to do.

