posts/leveraging-variadics/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 29 Sep. 2021 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Leveraging algebraic types in C++</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Daniel Grumberg">
<meta description='The personal website and blog of Daniel Grumberg'/>
<link rel='apple-touch-icon' sizes='180x180' href='/assets/apple-touch-icon.png'/>
<link rel='icon' type='image/png' sizes='32x32' href='/assets/favicon-32x32.png'/>
<link rel='icon' type='image/png' sizes='16x16' href='/assets/favicon-16x16.png'/>
<link rel='stylesheet' href='/css/code.css' type='text/css'/>
<link rel='stylesheet' href='/css/site.css' type='text/css'/>
<link rel='alternate' type='application+rss/xml' title='The personal website and blog of Daniel Grumberg' href='/rss.xml'/>
</head>
<body>
<header id="preamble" class="status">
<nav>
    <a href="/">About</a>
    <a href="/posts/archive.html">Blog</a>
  <div id="contact">
    <a href="/rss.xml"><i class="fas fa-rss-square"></i></a>
    <a href="/assets/cv.pdf"><i class="fas fa-file"></i></a>
    <a href="mailto:dany.grumberg@gmail.com"><i class="fas fa-envelope"></i></a>
    <a href="https://github.com/daniel-grumberg"><i class="fab fa-github-square"></i></a>
    <a href="https//twitter.com/danygrumberg"><i class="fab fa-twitter-square"></i></a>
    <a href="https://www.linkedin.com/in/daniel-grumberg/"><i class="fab fa-linkedin"></i></a>
  </div>
</nav>
</header>
<main id="content">
<header>
<h1 class="title">Leveraging algebraic types in C++</h1>
<p class="subtitle">Jul. 01 2018 by Daniel Grumberg</p>
</header>
<section id="outline-container-org974bb2e" class="outline-2">
<h2 id="org974bb2e">Introduction</h2>
<div class="outline-text-2" id="text-org974bb2e">
<p>
Today, we will be looking at the new flagship variadic types that are offered in modern C++ <a href="http://en.cppreference.com/w/cpp/utility/tuple"><code>std::tuple</code></a> and <a href="http://en.cppreference.com/w/cpp/utility/variant/variant"><code>std::variant</code></a>.
This post is not meant to teach you how to implement your own variadic templates, if you are into that check out my <a href=" ../variadic-templates/index.html">previous post</a>.
Instead, I focus on demonstrating the usage of the standard library&rsquo;s own variadic types, so don&rsquo;t sweat it if you are not a template meta-programming expert.
</p>

<p>
One of the main reasons variadic templates were introduced to the language in the C++11 standard was to enable the definitions of the product and sum types.
People refer to these as algebraic types due to the connection to algebra and set theory, but don&rsquo;t let that scare you away.
These are namely, <code>std::tuple</code> (introduced in C++11) and <code>std::variant</code> (introduced C++17) in that order.
</p>

<p>
Tuples are what you would expect if you have encountered them in other languages.
If you have never seen them before, they represent the Cartesian product of the provided template parameters (think of it as an anonymous struct with anonymous fields).
Variants aim to implement a better alternative to C-style unions.
</p>

<p>
Defining algebraic types was possible before C++11, but was somewhat convoluted and the usage was often unintuitive.
If you have ever implemented or dealt with typelists you will know what I mean.
However, we can now make use of the standard library&rsquo;s robust implementation of these ideas to easily improve the safety and readability of our code.
</p>
</div>
</section>

<section id="outline-container-orgd933da8" class="outline-2">
<h2 id="orgd933da8">Tuples</h2>
<div class="outline-text-2" id="text-orgd933da8">
<p>
As you know, we can not return multiple values from a function in C++.
To tackle this issue, we often define structs to encapsulate all the values we wish to return.
When we do this we often define useful abstractions in the problem domain, but there are a lot of cases where this introduces syntactic overhead.
Tuples are very interesting in this context.
They allow us to pass/return multiple logically grouped values at once without the burden of defining a type for this purpose.
Furthermore, they allow us to create compound types programmatically according to user input which can be an incredibly useful facility.
</p>
</div>

<div id="outline-container-orgcd7a911" class="outline-3">
<h3 id="orgcd7a911">API</h3>
<div class="outline-text-3" id="text-orgcd7a911">
<p>
The API is super simple, it provides constructors, destructor, a specialisation of the swap algorithm and comparison operators that operate lexicographically.
It also provides <code>tuple_cat</code> which concatenates any number of tuples into one big tuple, and <code>forward_as_tuple</code> which takes a bunch of r-value references and forwards them as a tuple of r-value references.
It also provides the nifty <code>make_tuple</code> which allows us to deduce the type of the tuple we are trying to instantiate, essentially it allows us to write <code>auto t = std::make_tuple(1u, 1.0f, true)</code> where <code>t</code> is deduced to be of type <code>tuple&lt;unsigned, float, bool&gt;</code>.
</p>

<p>
The one thing I have not touched upon is how to read individual values out of a tuple.
There are essentially three ways of doing this:
</p>

<ul class="org-ul">
<li><p>
If you want to read a single value out, your best option is <code>get</code>, which given a zero-based index will return a reference to the value contained in the tuple, the usage is a as follows:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">auto</span> <span class="org-variable-name">t</span> = <span class="org-constant">std</span>::make_tuple(1u, 1.0f, <span class="org-constant">true</span>);
<span class="org-keyword">auto</span> <span class="org-variable-name">f</span> = <span class="org-constant">std</span>::get&lt;1&gt;(t); <span class="org-comment-delimiter">// </span><span class="org-comment">f now has value 1.0f</span>
</pre>
</div></li>

<li><p>
If you want to read all the values in a tuple inside local variables, you should use <code>tie</code> instead of getting each value individually:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">auto</span> <span class="org-variable-name">t</span> = <span class="org-constant">std</span>::make_tuple(1u, 1.0f, <span class="org-constant">true</span>);
<span class="org-type">unsigned</span> <span class="org-variable-name">u</span>; <span class="org-type">float</span> <span class="org-variable-name">f</span>;
<span class="org-constant">std</span>::tie(u, f, <span class="org-constant">std</span>::ignore) = t; <span class="org-comment-delimiter">// </span><span class="org-comment">u now contains 1u and f contains 1.0f</span>
</pre>
</div></li>
</ul>

<p>
It achieves this seemingly magical behaviour by creating and returning a tuple of references to the provided variables.
The assignment happens simply through the tuple assignment operator between unrelated tuples.
Here <code>ignore</code> is a special value that acts as a placeholder for values we are not interested in.
</p>

<ul class="org-ul">
<li>The only problem with <code>tie</code> is that you have to pre-declare your variables and provide the types yourself.</li>
</ul>
<p>
This can lead to nasty surprises with implicit type conversions.
If you have a C++17 compliant compiler, you should use the new structured bindings feature instead.
These are now part of the language syntax so you can not implement them in user code, but the usage it lets type-inference work its magic, which provides the correct type for the variables:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">auto</span> <span class="org-variable-name">t</span> = <span class="org-constant">std</span>::make_tuple(1u, 1.0f, <span class="org-constant">true</span>);
<span class="org-keyword">auto</span> [u, f, dummy] = t; <span class="org-comment-delimiter">// </span><span class="org-comment">u now contains 1u and f contains 1.0f and dummy is true</span>
</pre>
</div>

<p>
The only issue with this is that you can not ignore values in the tuple.
In the above snippet the compiler would complain about <code>dummy</code> not being used in later code unless you supply <code>-Wunused-variable</code> to the compiler which you might not want to do.
</p>
</div>
</div>
