posts/2018-07-01-leveraging-variadics/index.org
** Automatic memoization

Automatic memoization is quite a neat example of the increased type safety and convenience we can achieve using tuples.
Imagine we wanted to write an automatic function memoizer in C++98, a possible implementation could look as follows:

#+BEGIN_SRC cpp
  template < class Out, class Inputs, class InputsCmp = std::less<Inputs> >
  struct Memoizer
  {
  public:
      typedef Out (*fn_type)(Inputs);
      Memoizer(fn_type fn) : fn_(fn) { }
      Out operator()(Inputs inputs)
      {
          typename Cache::iterator cache_val = cache_.find(inputs);
          if (cache_val == cache_.end())
          {
              Out res = fn_(inputs);
              cache_[inputs] = res;
              return res;
          }
          std::cout << "Cache hit" << std::endl;
          return cache_val->second;
      }

  private:
      typedef std::map<Inputs, Out, InputsCmp> Cache;
      fn_type fn_;
      Cache cache_;
  };
#+END_SRC

This is how I would go about defining an automatic memoizer in strict C++98.
The idea here is to define a functor object responsible for maintaining the cache of calls to some function ~fn~ that is passed in as a function pointer.
The trouble here, is that ~fn~ can only accept one argument.
A solution for this to write create wrappers for multi-argument functions that accept their arguments as a single struct.
We then need to provide either a specialisation of ~std::less~ for our input type, or a custom comparator functor.
The latter is the option I prefer, but I don't have a have a real justification for this.
This how we can wrap a call to a simple two argument function:

#+BEGIN_SRC cpp
  float simple_func(int a, float b);

  struct SimpleFuncIn
  {
      int a_;
      float b_;
      SimpleFuncIn(int a, float b) : a_(a), b_(b) { }
  };

  struct SimpleFuncCmp
  {
      bool operator()(SimpleFuncIn const& lhs, SimpleFuncIn const& rhs) const
      {
          if (lhs.a_ == rhs.a_) return lhs.b_ < rhs.b_;
          return lhs.a_ < rhs.a_;
      }
  };

  static float simple_func_wrap(SimpleFuncIn inputs)
  {
      return simple_func(inputs.a_, inputs.b_);
  }
#+END_SRC

And then somewhere later in the code, we can use our brand-new =Memoizer= like this:

#+BEGIN_SRC cpp
  Memoizer<float, SimpleFuncIn, SimpleFuncCmp> memoized_func_old(&simple_func_wrap);
  ...
  memoized_func_old(SimpleFuncIn(1, 2));
#+END_SRC

As a little aside, we can build a nifty little factory function for ~Memoizer~ that will deduce the template parameters for us.
A crude implementation could look like this:

#+BEGIN_SRC cpp
  template < class Out, class In, class InCmp >
  Memoizer<Out, In, InCmp> build_memo(Out (*fn)(In), InCmp cmp = std::less<In>())
  {
      return Memoizer<Out, In, InCmp>(fn);
  }
#+END_SRC

We see here that there is some syntactic overhead in the usage of our automatic memoizer.
We can use tuples and variadic templates to represent arbitrary function calls in the same way that uncurrying functions works in functional programming languages.
These new features as well as lambdas and automatic type inference can really help us in reducing the syntactic overhead of defining and using automatic memoization:

#+BEGIN_SRC cpp
  template <typename R, typename... Args>
  decltype(auto) memoize(R (*fn)(Args...))
  {
      std::map<std::tuple<Args...>, R> cache;

      return [=](Args... args) mutable -> R
      {
          auto arg_tuple = std::make_tuple(args...);
          auto cache_val = cache.find(arg_tuple);
          if (cache_val == cache.end())
          {
              auto res = fn(args...);
              cache[arg_tuple] = res;
              return res;
          }
          std::cout << "Cache hit" << std::endl;
          return cache_val->second;
      };
  }
#+END_SRC

We don't need to define our own memoizer type as we can simply return a lambda that will have the same functionality.
We use tuples to represent the arguments to the function and variadic templates to allow an arbitrary number them.
The main logic is largely unchanged a part from the usage of ~std::make_tuple~ to "uncurry" the call and provide a single object for the arguments the same way our wrapper struct worked in the C++98 example.

The usage is incredibly simple and does not require us to specify a bunch of template parameters or to define custom types and comparators:

#+BEGIN_SRC cpp
  auto memoized_func = memoize(simple_func);
  ...
  memoized_func(1, 2);
#+END_SRC

* Variants
