posts/leveraging-variadics/index.html

<div id="outline-container-org6bd2695" class="outline-3">
<h3 id="org6bd2695">Automatic memoization</h3>
<div class="outline-text-3" id="text-org6bd2695">
<p>
Automatic memoization is quite a neat example of the increased type safety and convenience we can achieve using tuples.
Imagine we wanted to write an automatic function memoizer in C++98, a possible implementation could look as follows:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">template</span> &lt; <span class="org-keyword">class</span> <span class="org-type">Out</span>, <span class="org-keyword">class</span> <span class="org-type">Inputs</span>, <span class="org-keyword">class</span> <span class="org-type">InputsCmp</span> = <span class="org-constant">std</span>::<span class="org-type">less</span>&lt;<span class="org-type">Inputs</span>&gt; &gt;
<span class="org-keyword">struct</span> <span class="org-type">Memoizer</span>
{
<span class="org-keyword">public</span>:
    <span class="org-keyword">typedef</span> <span class="org-type">Out</span> (*<span class="org-type">fn_type</span>)(<span class="org-type">Inputs</span>);
    <span class="org-function-name">Memoizer</span>(<span class="org-type">fn_type</span> <span class="org-variable-name">fn</span>) : fn_(fn) { }
    <span class="org-type">Out</span> <span class="org-keyword">operator</span><span class="org-function-name">()</span>(<span class="org-type">Inputs</span> <span class="org-variable-name">inputs</span>)
    {
        <span class="org-keyword">typename</span> <span class="org-constant">Cache</span>::<span class="org-type">iterator</span> <span class="org-variable-name">cache_val</span> = cache_.find(inputs);
        <span class="org-keyword">if</span> (cache_val == cache_.end())
        {
            <span class="org-type">Out</span> <span class="org-variable-name">res</span> = fn_(inputs);
            cache_[inputs] = res;
            <span class="org-keyword">return</span> res;
        }
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"Cache hit"</span> &lt;&lt; <span class="org-constant">std</span>::endl;
        <span class="org-keyword">return</span> cache_val-&gt;second;
    }

<span class="org-keyword">private</span>:
    <span class="org-keyword">typedef</span> <span class="org-constant">std</span>::<span class="org-type">map</span>&lt;<span class="org-type">Inputs</span>, <span class="org-type">Out</span>, <span class="org-type">InputsCmp</span>&gt; <span class="org-type">Cache</span>;
    <span class="org-type">fn_type</span> <span class="org-variable-name">fn_</span>;
    <span class="org-type">Cache</span> <span class="org-variable-name">cache_</span>;
};
</pre>
</div>

<p>
This is how I would go about defining an automatic memoizer in strict C++98.
The idea here is to define a functor object responsible for maintaining the cache of calls to some function <code>fn</code> that is passed in as a function pointer.
The trouble here, is that <code>fn</code> can only accept one argument.
A solution for this to write create wrappers for multi-argument functions that accept their arguments as a single struct.
We then need to provide either a specialisation of <code>std::less</code> for our input type, or a custom comparator functor.
The latter is the option I prefer, but I don&rsquo;t have a have a real justification for this.
This how we can wrap a call to a simple two argument function:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-type">float</span> <span class="org-function-name">simple_func</span>(<span class="org-type">int</span> <span class="org-variable-name">a</span>, <span class="org-type">float</span> <span class="org-variable-name">b</span>);

<span class="org-keyword">struct</span> <span class="org-type">SimpleFuncIn</span>
{
    <span class="org-type">int</span> <span class="org-variable-name">a_</span>;
    <span class="org-type">float</span> <span class="org-variable-name">b_</span>;
    <span class="org-function-name">SimpleFuncIn</span>(<span class="org-type">int</span> <span class="org-variable-name">a</span>, <span class="org-type">float</span> <span class="org-variable-name">b</span>) : a_(a), b_(b) { }
};

<span class="org-keyword">struct</span> <span class="org-type">SimpleFuncCmp</span>
{
    <span class="org-type">bool</span> <span class="org-keyword">operator</span><span class="org-function-name">()</span>(<span class="org-type">SimpleFuncIn</span> <span class="org-keyword">const</span>&amp; <span class="org-variable-name">lhs</span>, <span class="org-type">SimpleFuncIn</span> <span class="org-keyword">const</span>&amp; <span class="org-variable-name">rhs</span>) <span class="org-keyword">const</span>
    {
        <span class="org-keyword">if</span> (lhs.a_ == rhs.a_) <span class="org-keyword">return</span> lhs.b_ &lt; rhs.b_;
        <span class="org-keyword">return</span> lhs.a_ &lt; rhs.a_;
    }
};

<span class="org-keyword">static</span> <span class="org-type">float</span> <span class="org-function-name">simple_func_wrap</span>(<span class="org-type">SimpleFuncIn</span> <span class="org-variable-name">inputs</span>)
{
    <span class="org-keyword">return</span> simple_func(inputs.a_, inputs.b_);
}
</pre>
</div>

<p>
And then somewhere later in the code, we can use our brand-new <code>Memoizer</code> like this:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-type">Memoizer</span>&lt;<span class="org-type">float</span>, SimpleFuncIn, SimpleFuncCmp&gt; <span class="org-variable-name">memoized_func_old</span>(&amp;simple_func_wrap);
...
memoized_func_old(SimpleFuncIn(1, 2));
</pre>
</div>

<p>
As a little aside, we can build a nifty little factory function for <code>Memoizer</code> that will deduce the template parameters for us.
A crude implementation could look like this:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">template</span> &lt; <span class="org-keyword">class</span> <span class="org-type">Out</span>, <span class="org-keyword">class</span> <span class="org-type">In</span>, <span class="org-keyword">class</span> <span class="org-type">InCmp</span> &gt;
<span class="org-type">Memoizer</span>&lt;<span class="org-type">Out</span>, <span class="org-type">In</span>, <span class="org-type">InCmp</span>&gt; <span class="org-function-name">build_memo</span>(<span class="org-type">Out</span> (*<span class="org-function-name">fn</span>)(<span class="org-type">In</span>), <span class="org-type">InCmp</span> <span class="org-variable-name">cmp</span> = <span class="org-constant">std</span>::less&lt;<span class="org-type">In</span>&gt;())
{
    <span class="org-keyword">return</span> Memoizer&lt;<span class="org-type">Out</span>, <span class="org-type">In</span>, <span class="org-type">InCmp</span>&gt;(fn);
}
</pre>
</div>

<p>
We see here that there is some syntactic overhead in the usage of our automatic memoizer.
We can use tuples and variadic templates to represent arbitrary function calls in the same way that uncurrying functions works in functional programming languages.
These new features as well as lambdas and automatic type inference can really help us in reducing the syntactic overhead of defining and using automatic memoization:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">template</span> &lt;<span class="org-keyword">typename</span> <span class="org-type">R</span>, <span class="org-keyword">typename</span>... <span class="org-type">Args</span>&gt;
<span class="org-keyword">decltype</span>(<span class="org-keyword">auto</span>) <span class="org-function-name">memoize</span>(<span class="org-type">R</span> (*<span class="org-function-name">fn</span>)(<span class="org-type">Args</span>...))
{
    <span class="org-constant">std</span>::<span class="org-type">map</span>&lt;<span class="org-constant">std</span>::<span class="org-type">tuple</span>&lt;<span class="org-type">Args</span>...&gt;, <span class="org-type">R</span>&gt; <span class="org-variable-name">cache</span>;

    <span class="org-keyword">return</span> [=](<span class="org-type">Args</span>... <span class="org-variable-name">args</span>) <span class="org-keyword">mutable</span> -&gt; R
    {
        <span class="org-keyword">auto</span> <span class="org-variable-name">arg_tuple</span> = <span class="org-constant">std</span>::make_tuple(args...);
        <span class="org-keyword">auto</span> <span class="org-variable-name">cache_val</span> = cache.find(arg_tuple);
        <span class="org-keyword">if</span> (cache_val == cache.end())
        {
            <span class="org-keyword">auto</span> <span class="org-variable-name">res</span> = fn(args...);
            cache[arg_tuple] = res;
            <span class="org-keyword">return</span> res;
        }
        <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"Cache hit"</span> &lt;&lt; <span class="org-constant">std</span>::endl;
        <span class="org-keyword">return</span> cache_val-&gt;second;
    };
}
</pre>
</div>

<p>
We don&rsquo;t need to define our own memoizer type as we can simply return a lambda that will have the same functionality.
We use tuples to represent the arguments to the function and variadic templates to allow an arbitrary number them.
The main logic is largely unchanged a part from the usage of <code>std::make_tuple</code> to &ldquo;uncurry&rdquo; the call and provide a single object for the arguments the same way our wrapper struct worked in the C++98 example.
</p>

<p>
The usage is incredibly simple and does not require us to specify a bunch of template parameters or to define custom types and comparators:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">auto</span> <span class="org-variable-name">memoized_func</span> = memoize(simple_func);
...
memoized_func(1, 2);
</pre>
</div>
</div>
</div>
</section>
