posts/2018-07-01-leveraging-variadics/index.org
** API

A variant can only contain one of its underlying types, or in case of an error no value (this is quite hard to achieve, as it only happens if an initialization operation on the underlying storage throws an exception).
However you can easily detect this state by calling ~valueless_by_exception~ on the variant instance.
This is a big step up over the traditional ~union~ type as it makes holding non POD (plain old data) types automatic, and it has well defined semantics for errors when constructing those complex types.
The API for ~std::variant~ is very simple, it provides, the usual suspects (constructors, destructor, assignment operator, and swap) and some more peculiar operations:

- ~emplace~ allows us to construct values inside the variant, in place.
- ~index~ gives the zero-based index of the alternative in the variant.
- ~valueless_by_exception~ checks if the variant is in an error state.

You also get a bunch of non-member functions that provide incredibly useful functionality:

- comparison operators compare variants as their contained values - ~holds_alternative~ given a template type, tells us if the variant currently contains it.
- ~get~ given an index or a type (if it is unique in the alternative list) returns a reference to the value contained by the variant if it matches the given type index otherwise throws an error.
- ~get_if~ does the same as get but returns a pointer to the value in the variant, otherwise it returns a null pointer.
- ~visit~ applies the given functor to all the variants provided as arguments, it is only valid if the functor is valid for all alternatives in the variant.

You can of course find more about this on [[http://en.cppreference.com/w/cpp/utility/variant][cppreference]].

