posts/leveraging-variadics/index.html

<section id="outline-container-orgcdb3093" class="outline-2">
<h2 id="orgcdb3093">Variants</h2>
<div class="outline-text-2" id="text-orgcdb3093">
</div>
<div id="outline-container-org97bf9f0" class="outline-3">
<h3 id="org97bf9f0">API</h3>
<div class="outline-text-3" id="text-org97bf9f0">
<p>
A variant can only contain one of its underlying types, or in case of an error no value (this is quite hard to achieve, as it only happens if an initialization operation on the underlying storage throws an exception).
However you can easily detect this state by calling <code>valueless_by_exception</code> on the variant instance.
This is a big step up over the traditional <code>union</code> type as it makes holding non POD (plain old data) types automatic, and it has well defined semantics for errors when constructing those complex types.
The API for <code>std::variant</code> is very simple, it provides, the usual suspects (constructors, destructor, assignment operator, and swap) and some more peculiar operations:
</p>

<ul class="org-ul">
<li><code>emplace</code> allows us to construct values inside the variant, in place.</li>
<li><code>index</code> gives the zero-based index of the alternative in the variant.</li>
<li><code>valueless_by_exception</code> checks if the variant is in an error state.</li>
</ul>

<p>
You also get a bunch of non-member functions that provide incredibly useful functionality:
</p>

<ul class="org-ul">
<li>comparison operators compare variants as their contained values - <code>holds_alternative</code> given a template type, tells us if the variant currently contains it.</li>
<li><code>get</code> given an index or a type (if it is unique in the alternative list) returns a reference to the value contained by the variant if it matches the given type index otherwise throws an error.</li>
<li><code>get_if</code> does the same as get but returns a pointer to the value in the variant, otherwise it returns a null pointer.</li>
<li><code>visit</code> applies the given functor to all the variants provided as arguments, it is only valid if the functor is valid for all alternatives in the variant.</li>
</ul>

<p>
You can of course find more about this on <a href="http://en.cppreference.com/w/cpp/utility/variant">cppreference</a>.
</p>
</div>
</div>
