posts/2018-07-01-leveraging-variadics/index.org
** Using Variants to improve type-safety

An interesting application of variant types is to concisely and elegantly define finite state machines and many associated patterns.
This allows us to implement the Type State pattern and eliminate an entire class of common bugs.
I will show an interesting example I extended from Ben Deane's CppCon16 [[https://www.youtube.com/watch?v=ojZbFIQSdl8][talk]].
The following snippet is something you might find in any older codebase, that can be improved through the usage of variants:

#+BEGIN_SRC cpp
  enum class ConnectionState
  {
      DISCONNECTED,
      CONNECTING,
      CONNECTED,
      CONNECTION_INTERRUPTED
  }

  struct Connection
  {
      ConnectionState m_connectionState;

      // Notify all the Connection's observers of the interuption
      void notifyInterrupted();

      std::string m_serverAddress;
      ConnectionId m_id;
      std::chrono::system_clock::time_point m_connectedTime;
      std::chrono::milliseconds m_lastPingTime;
      Timer m_reconnectTimer;
  }
#+END_SRC

This looks like it works quite well on the surface, but the important thing to realise here is that certain fields of ~Connection~ only make sense in certain connection states.
For example, ~m_connectedTime~ only makes sense in the ~CONNECTED~ state, worse even, people often will reuse that field to mean disconnected time in the ~CONNECTION_INTERRUPTED~ state only documenting through a comment or not all.
Similarly ~m_lastPingTime~ only makes sense in the ~CONNECTED~ state and ~m_reconnectTimer~ only has adds value in the ~CONNECTION_INTERRUPTED~ state.
The trouble here is that the programmer has to ensure that all field accesses are predicated by checks to the current connection state and we need discipline to ensure we don't reuse fields in states they weren't meant for.
Variants are quite useful here as they allow us to tie data to the underlying state.
A nice reworking of the above code would be:

#+BEGIN_SRC cpp
  struct Connection
  {
      std::string m_serverAddress;

      struct Disconnected { };
      struct Connecting { };
      struct Connected
      {
          std::chrono::system_clock::time_point m_connectedTime;
          std::chrono::milliseconds m_lastPingTime;
      };
      struct ConnectionInterrupted
      {
          std::chrono::system_clock::time_point m_disconnectedTime;
          Timer m_reconnectTimer;
      };

      // Notify all the Connection's observers of the interuption
      void notifyInterrupted();

      typedef state_t std::variant<Disconnected,
          Connecting,
          Connected,
          ConnectionInterrupted>;

      state_t m_connection;
  }
#+END_SRC

The advantage of this version is the tighter coupling between the connection state and the relevant data.
Thus state transition are much cleaner as we can not leave unrelated fields in limbo any more, which is something Ben mentioned in his talk.
Furthermore, a variant occupies roughly as much space as the largest underlying type, which means that we reduced the memory footprint of the ~Connection~ struct.

In this implementation, a state transition is made by assigning a value to the variant.
We could represent the disconnection state transition by a simple method in the ~Connection~ struct:

#+BEGIN_SRC cpp
  void disconnect() {
      m_connection = Disconnected();
  }
#+END_SRC

This is a very simple scheme, but we can run into issues when the state transition depends on the current state.
To implement this using simple member functions, we would need to manually check for the current connection and implement messy conditions inside each transition method.
Instead, we can model this kind of behaviour using the ~visit~ API of the variant type.
We can then create a functor for each event type we want to implement, for example we can implement the ~InterruptedEvent~ as follows:

#+BEGIN_SRC cpp
  struct InterruptedEvent {
      InterruptedEvent(Connection& c) : m_c(c) { }

      Connection::state_t operator() (const Connection::Disconnected& s) { return s; }
      Connection::state_t operator() (const Connection::Connecting& s) { return Connection::Disconnected(); }
      Connection::state_t operator() (const Connection::Connected& s) {
          const auto now = std::chrono::system_clock::now();
          m_c.notifyInterrupted();
          return Connection::ConnectionInterrupted{now, 100};
      }
      Connection::state_t operator() (const Connection::ConnectionInterrupted& s) { return s; }

  private:
      Connection& m_c;
#+END_SRC

We can then implement the transition:

#+BEGIN_SRC cpp
  template <typename T>
  void transition() {
      m_connection = std::visit(T(*this), m_connection);
  }
#+END_SRC

This requires each T to conform to the requirements of events.
Let's take ~InterruptedEvent~ as an example.
To make this work, the ~InterruptedEvent~ must provide an overload of ~operator()~ for each variant alternative.
We also construct it with a reference to the underlying ~Connection~ to enable it to use its API.
In this pattern it is often desirable to perform state entry actions in the constructors of the variant alternatives.

An alternative to the visitation scheme is to have all the variant alternatives inherit from a class defining stub for all the FSM transitions.
We can then implement each transition as members of the ~Connection~ class.
Let's look at the implementation of interruption in this scheme:

#+BEGIN_SRC cpp
  void interrupt() {
      const auto ind = m_connection.index();
      auto curr_state = std::get<ind>(m_connection);
      curr_state.interrupt();
  }
#+END_SRC

I personally prefer the visitor method as it decouples the transitions from the actual connection state.
It allows us to keep related functionality in the same class.
Furthermore with C++17 we don't need to define a separate type for the state transition functor.
We can leverage lambdas and the new ~if constexpr~ statements to get the best of both worlds as detailed below:

#+BEGIN_SRC cpp
  void interrupt() {
      m_connection = std::visit([&](auto& s) {
          using T = std::decay<decltype(s)>;
          if constexpr (std::is_same_v<T, Connected) {
              const auto now = std::chrono::system_clock::now();
              notifyInterrupted();
              return ConnectionInterrupted{ now, 100 };
          }
          else if constexpr (std::is_same_v<T, Connecting>) {
              return Disconnected();
          }
          else
          {
              return s;
          }
      }, m_connection);
  }
#+END_SRC

I personally prefer to define the functor explicitly as we are then able to create new state transitions without having to touch the implementation of the ~Connection~ class and thus not add methods to its public API.
However, this is largely a matter of taste.

We were able to eliminate an entire class of bugs in our finite state machine, reduce its memory footprint and improve the readability of state transitions.
I don't know about you, but I am finding this pretty exciting!

