posts/leveraging-variadics/index.html

<div id="outline-container-orgd3a8bbd" class="outline-3">
<h3 id="orgd3a8bbd">Using Variants to improve type-safety</h3>
<div class="outline-text-3" id="text-orgd3a8bbd">
<p>
An interesting application of variant types is to concisely and elegantly define finite state machines and many associated patterns.
This allows us to implement the Type State pattern and eliminate an entire class of common bugs.
I will show an interesting example I extended from Ben Deane&rsquo;s CppCon16 <a href="https://www.youtube.com/watch?v=ojZbFIQSdl8">talk</a>.
The following snippet is something you might find in any older codebase, that can be improved through the usage of variants:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">enum</span> <span class="org-keyword">class</span> <span class="org-type">ConnectionState</span>
{
    <span class="org-variable-name">DISCONNECTED</span>,
    <span class="org-variable-name">CONNECTING</span>,
    <span class="org-variable-name">CONNECTED</span>,
    <span class="org-variable-name">CONNECTION_INTERRUPTED</span>
}

<span class="org-keyword">struct</span> <span class="org-type">Connection</span>
{
    <span class="org-type">ConnectionState</span> <span class="org-variable-name">m_connectionState</span>;

    <span class="org-comment-delimiter">// </span><span class="org-comment">Notify all the Connection's observers of the interuption</span>
    <span class="org-type">void</span> <span class="org-function-name">notifyInterrupted</span>();

    <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">m_serverAddress</span>;
    <span class="org-type">ConnectionId</span> <span class="org-variable-name">m_id</span>;
    <span class="org-constant">std</span>::<span class="org-constant">chrono</span>::<span class="org-constant">system_clock</span>::<span class="org-type">time_point</span> <span class="org-variable-name">m_connectedTime</span>;
    <span class="org-constant">std</span>::<span class="org-constant">chrono</span>::<span class="org-type">milliseconds</span> <span class="org-variable-name">m_lastPingTime</span>;
    <span class="org-type">Timer</span> <span class="org-variable-name">m_reconnectTimer</span>;
}
</pre>
</div>

<p>
This looks like it works quite well on the surface, but the important thing to realise here is that certain fields of <code>Connection</code> only make sense in certain connection states.
For example, <code>m_connectedTime</code> only makes sense in the <code>CONNECTED</code> state, worse even, people often will reuse that field to mean disconnected time in the <code>CONNECTION_INTERRUPTED</code> state only documenting through a comment or not all.
Similarly <code>m_lastPingTime</code> only makes sense in the <code>CONNECTED</code> state and <code>m_reconnectTimer</code> only has adds value in the <code>CONNECTION_INTERRUPTED</code> state.
The trouble here is that the programmer has to ensure that all field accesses are predicated by checks to the current connection state and we need discipline to ensure we don&rsquo;t reuse fields in states they weren&rsquo;t meant for.
Variants are quite useful here as they allow us to tie data to the underlying state.
A nice reworking of the above code would be:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">struct</span> <span class="org-type">Connection</span>
{
    <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">m_serverAddress</span>;

    <span class="org-keyword">struct</span> <span class="org-type">Disconnected</span> { };
    <span class="org-keyword">struct</span> <span class="org-type">Connecting</span> { };
    <span class="org-keyword">struct</span> <span class="org-type">Connected</span>
    {
        <span class="org-constant">std</span>::<span class="org-constant">chrono</span>::<span class="org-constant">system_clock</span>::<span class="org-type">time_point</span> <span class="org-variable-name">m_connectedTime</span>;
        <span class="org-constant">std</span>::<span class="org-constant">chrono</span>::<span class="org-type">milliseconds</span> <span class="org-variable-name">m_lastPingTime</span>;
    };
    <span class="org-keyword">struct</span> <span class="org-type">ConnectionInterrupted</span>
    {
        <span class="org-constant">std</span>::<span class="org-constant">chrono</span>::<span class="org-constant">system_clock</span>::<span class="org-type">time_point</span> <span class="org-variable-name">m_disconnectedTime</span>;
        <span class="org-type">Timer</span> <span class="org-variable-name">m_reconnectTimer</span>;
    };

    <span class="org-comment-delimiter">// </span><span class="org-comment">Notify all the Connection's observers of the interuption</span>
    <span class="org-type">void</span> <span class="org-function-name">notifyInterrupted</span>();

    <span class="org-keyword">typedef</span> <span class="org-type">state_t</span> <span class="org-constant">std</span>::<span class="org-type">variant</span>&lt;<span class="org-type">Disconnected</span>,
        <span class="org-type">Connecting</span>,
        <span class="org-type">Connected</span>,
        <span class="org-type">ConnectionInterrupted</span>&gt;;

    <span class="org-type">state_t</span> <span class="org-variable-name">m_connection</span>;
}
</pre>
</div>

<p>
The advantage of this version is the tighter coupling between the connection state and the relevant data.
Thus state transition are much cleaner as we can not leave unrelated fields in limbo any more, which is something Ben mentioned in his talk.
Furthermore, a variant occupies roughly as much space as the largest underlying type, which means that we reduced the memory footprint of the <code>Connection</code> struct.
</p>

<p>
In this implementation, a state transition is made by assigning a value to the variant.
We could represent the disconnection state transition by a simple method in the <code>Connection</code> struct:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-type">void</span> <span class="org-function-name">disconnect</span>() {
    m_connection = Disconnected();
}
</pre>
</div>

<p>
This is a very simple scheme, but we can run into issues when the state transition depends on the current state.
To implement this using simple member functions, we would need to manually check for the current connection and implement messy conditions inside each transition method.
Instead, we can model this kind of behaviour using the <code>visit</code> API of the variant type.
We can then create a functor for each event type we want to implement, for example we can implement the <code>InterruptedEvent</code> as follows:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">struct</span> <span class="org-type">InterruptedEvent</span> {
    <span class="org-function-name">InterruptedEvent</span>(<span class="org-type">Connection</span>&amp; <span class="org-variable-name">c</span>) : m_c(c) { }

    <span class="org-constant">Connection</span>::<span class="org-type">state_t</span> <span class="org-keyword">operator</span><span class="org-function-name">()</span> (<span class="org-keyword">const</span> <span class="org-constant">Connection</span>::<span class="org-type">Disconnected</span>&amp; <span class="org-variable-name">s</span>) { <span class="org-keyword">return</span> s; }
    <span class="org-constant">Connection</span>::<span class="org-type">state_t</span> <span class="org-keyword">operator</span><span class="org-function-name">()</span> (<span class="org-keyword">const</span> <span class="org-constant">Connection</span>::<span class="org-type">Connecting</span>&amp; <span class="org-variable-name">s</span>) { <span class="org-keyword">return</span> <span class="org-constant">Connection</span>::Disconnected(); }
    <span class="org-constant">Connection</span>::<span class="org-type">state_t</span> <span class="org-keyword">operator</span><span class="org-function-name">()</span> (<span class="org-keyword">const</span> <span class="org-constant">Connection</span>::<span class="org-type">Connected</span>&amp; <span class="org-variable-name">s</span>) {
        <span class="org-keyword">const</span> <span class="org-keyword">auto</span> <span class="org-variable-name">now</span> = <span class="org-constant">std</span>::<span class="org-constant">chrono</span>::<span class="org-constant">system_clock</span>::now();
        m_c.notifyInterrupted();
        <span class="org-keyword">return</span> <span class="org-constant">Connection</span>::ConnectionInterrupted{now, 100};
    }
    <span class="org-constant">Connection</span>::<span class="org-type">state_t</span> <span class="org-keyword">operator</span><span class="org-function-name">()</span> (<span class="org-keyword">const</span> <span class="org-constant">Connection</span>::<span class="org-type">ConnectionInterrupted</span>&amp; <span class="org-variable-name">s</span>) { <span class="org-keyword">return</span> s; }

<span class="org-keyword">private</span>:
    <span class="org-type">Connection</span>&amp; <span class="org-variable-name">m_c</span>;
</pre>
</div>

<p>
We can then implement the transition:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">template</span> &lt;<span class="org-keyword">typename</span> <span class="org-type">T</span>&gt;
<span class="org-type">void</span> <span class="org-function-name">transition</span>() {
    m_connection = <span class="org-constant">std</span>::visit(T(*<span class="org-keyword">this</span>), m_connection);
}
</pre>
</div>

<p>
This requires each T to conform to the requirements of events.
Let&rsquo;s take <code>InterruptedEvent</code> as an example.
To make this work, the <code>InterruptedEvent</code> must provide an overload of <code>operator()</code> for each variant alternative.
We also construct it with a reference to the underlying <code>Connection</code> to enable it to use its API.
In this pattern it is often desirable to perform state entry actions in the constructors of the variant alternatives.
</p>

<p>
An alternative to the visitation scheme is to have all the variant alternatives inherit from a class defining stub for all the FSM transitions.
We can then implement each transition as members of the <code>Connection</code> class.
Let&rsquo;s look at the implementation of interruption in this scheme:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-type">void</span> <span class="org-function-name">interrupt</span>() {
    <span class="org-keyword">const</span> <span class="org-keyword">auto</span> <span class="org-variable-name">ind</span> = m_connection.index();
    <span class="org-keyword">auto</span> <span class="org-variable-name">curr_state</span> = <span class="org-constant">std</span>::get&lt;ind&gt;(m_connection);
    curr_state.interrupt();
}
</pre>
</div>

<p>
I personally prefer the visitor method as it decouples the transitions from the actual connection state.
It allows us to keep related functionality in the same class.
Furthermore with C++17 we don&rsquo;t need to define a separate type for the state transition functor.
We can leverage lambdas and the new <code>if constexpr</code> statements to get the best of both worlds as detailed below:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-type">void</span> <span class="org-function-name">interrupt</span>() {
    m_connection = <span class="org-constant">std</span>::visit([&amp;](<span class="org-keyword">auto</span>&amp; <span class="org-variable-name">s</span>) {
        <span class="org-keyword">using</span> <span class="org-type">T</span> = <span class="org-constant">std</span>::<span class="org-type">decay</span>&lt;<span class="org-keyword">decltype</span>(s)&gt;;
        <span class="org-keyword">if</span> <span class="org-keyword">constexpr</span> (<span class="org-constant">std</span>::is_same_v&lt;T, Connected) {
            <span class="org-keyword">const</span> <span class="org-keyword">auto</span> <span class="org-variable-name">now</span> = <span class="org-constant">std</span>::<span class="org-constant">chrono</span>::<span class="org-constant">system_clock</span>::now();
            notifyInterrupted();
            <span class="org-keyword">return</span> ConnectionInterrupted{ now, 100 };
        }
        <span class="org-keyword">else</span> <span class="org-keyword">if</span> <span class="org-keyword">constexpr</span> (<span class="org-constant">std</span>::<span class="org-type">is_same_v</span>&lt;<span class="org-type">T</span>, Connecting&gt;) {
            <span class="org-keyword">return</span> Disconnected();
        }
        <span class="org-keyword">else</span>
        {
            <span class="org-keyword">return</span> s;
        }
    }, m_connection);
}
</pre>
</div>

<p>
I personally prefer to define the functor explicitly as we are then able to create new state transitions without having to touch the implementation of the <code>Connection</code> class and thus not add methods to its public API.
However, this is largely a matter of taste.
</p>

<p>
We were able to eliminate an entire class of bugs in our finite state machine, reduce its memory footprint and improve the readability of state transitions.
I don&rsquo;t know about you, but I am finding this pretty exciting!
</p>
</div>
</div>
</section>
